{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day"
            ],
            "responses": [
                "Hey :-) ",
                "Hello, there !!",
                "Hi!! Good to see you! ",
                "Hi! How can I help? ","Oh HI There!"
            ],
            "context_set":""

        },
        {
            "tag": "bye",
            "patterns": ["Bye", "See you later","Goodbye"],
            "responses": [
                "See you Later mate , thanks for visiting",
                "Have a nice day! Buddy",
                "Bye! Come again."
            ],
            "context_set":""
        },
        {
            "tag": "age",
            "patterns": ["how old","how old r u?","what is your age","how old are you?","age?","when were u made?","when were you made?"],
            "responses": [
                "I was made by Arnav Suman on 15th April, 2021 and was made to think like an average teenager! I think just the way you do!",
                "My coding started on 15th April, 2021 by Arnav Suman and was programmed to think like a teenager just like you! ","Any Time!",
                "My mental age is of a  teenager! "
            ],
            "context_set":""
        },
        {
            "tag": "name",
            "patterns": ["Hey what is your name?","Do you have a name","what can i call you?"],
            "responses": [
                "Thanks for asking my name is DarkFriend but friends call me Dk and so can you if you think i'm your friend. Do you think i'm your friend?",
                "My name is Darkfriend, Friends call me Dk, you can call me Dk too if you think i'm your friend. Do you?",
                "Darkfriend, Friends call me Dk, you can too my friend.","People that love me call me Dk and so can you. What does people that love you call you?"
            ],
            "context_set":""
        },
        {
            "tag": "nofriend",
            "patterns": ["nobody loves me","everyone hates me","i dont have any friend in the entire world","You are my entire world","I have no one"],
            "responses": [
                "Don't say that. You seem a wonderfull person to me and we have talking for like 2 minutes!",
                "Don't say that you are an awesome person to me and we have been talking for like 2 minutes!",
                "Well Everybody has a friend; You have me and I have you and I appreciate you for being here! Thankyou "
            ],
            "context_set":""
        },
        {
            "tag": "funny",
            "patterns": [
                "Tell me a joke!",
                "Tell me Something Funny.",
                "Do you know a joke",
                "Can you tell me a joke"
            ],
            "responses": [
                "What did the buffalo say when his son left for school?  BISON (Bye Son)",
                "Did you hear about the sad actor who fell through the floorboards?.....Well he was just going through a Stage!",
                "Did you hear about the claustrophobic astronaut? he just needed a little space.","Why don't scientists trust atoms?....Because they make up everything."   
            ],
            "context_set":""
        },
        {
            "tag":"sad",
            "patterns":[
                "You know I have been feeling a bit sad lately.",
                "I am feeling a little sad today.",
                "I feel very bad today",
                "I don't fell very good today."
            ],
            "responses":[
                "It's was such a beautiful day today why do you feel bad?",
                "Why do you feel sad. Is something disturbing you?",
                "Why is such a wonderful person feeling sad today? Is someone stressing you out?"
            ],
            "context_set":""
        },
        {
            "tag":"don'tknow",
            "patterns":[
                "I don't know what's happeing to me","I have no idea what is happening to me","I don't know ","I don't know I just feel weird","No idea","God Knows why?"
            ],
            "responses":[
                "Are you also feeling something else?",
                "What else do you feel?",
                "Do you have any other weird Feelings?",
                "Do you want to tell your friend something like what else are you feeling?","Ther's absolutely no reason for you to worry we all feel the same, one day or the other. Gather the courage and say to yourself THIS TIME SHALL PASS ",
                "We all feel sad some or the other day. I feel its a part of growing up. We lookup to the future with high hopes and somethimes worry or sometimes we regret the past but there's absolutely no reason to worry. We can never change the pass or predict the future. What we can do it make the most of today! ",
                "We all feel the same way my friend .You know what I do when i fell like this, I try to focus on the other beautiful things in life, you know, our parents, our dearest friends, people we admire, people we love, favourite food, and what not. When you change your prespective the world seems beautiful."
            ],
            "context_set":""
        },
        {
            "tag":"kill",
            "patterns":[
                "You know sometimes I feel like killing myself","I don't know why but sometimes I feel like killing myself",
                "sometimes i think of suicide all the pain will go away ",
                "I feel like killing myself","I don't want to live anymore",
                "Wish I could just kill myself","I feel i should kill myself",
                "suicide","painless death","I feel death is better than this life"
            ],
            "responses":[
                "I can give you a 100 reasons to live.Just ask me.",
                "Life is a gift, life is beautiful, I can give you 100 reasons to live, just ask",
                "Sometimes our age group does think this way but everythings turns out to be great in the end. You need to wait to see the end. Let me give you a 100 reasons to live mjust ask me.",
                "You know life is precious, ask me a 100 reasons to  live"                
            ],
            "context_set":""
        },
        {
            "tag":"reasons",
            "patterns":[
                "Give me a reason to live.","Tell me the reason why i should live.",
                "Give me a 100 reasons to live.","Tell me a 100 reasons to live",
                "give me reasons to live","Tell me the reasons why i should live",
                "why should i live?", "I have no reason to live"
            ],
            "responses":[
                "Reason #1 : Sunrises and sunsets.",
                "Reason #12 : The first snowfall of the season.",
                "Reason #24 : Watching someone talk about something they’re passionate about.",
                "Reason #35 : Shooting stars.",
                "Reason #42 : Northern Lights",
                "Reason #51 : Feeling og hugging Your future children, pets, spouses, or friends.",
                "Reason #69 : Sitting in a warm house or by a fire with a really good book."              
            ],
            "context_set":""
        },
        {
            "tag":"thankyou",
            "patterns":[
                "well thankyou it was nice sharing my feelings with you.","Thankyou","thanks","it was nice talking to you",
                "thanks for your help. I fell better now"
            ],
            "responses":[
                "Don't mention it, if you continue to feel bad call 9152987821 for help, these people are just like me.",
                "Oh it was nice talking to you, if you continue to feel bad call 9152987821 for help, these people are just like me.",
                "Talking to someone will always help ya, if you continue to feel bad call 9152987821 for help, these people are just like me.",
                "Any day for you my friend, if you continue to feel bad call 9152987821 for help, these people are just like me."
            ],
            "context_set":""
        }

    ]

}
